{
  "title": "Security Onion 2.1.0 RC2 is here!",
  "changes": [
    { "summary": "Known Issue: Once you update your grid to RC2, any new nodes that join the grid must be RC2 so if you try to join a new RC1 node it will fail. For best results, use the latest RC2 ISO (or RC2 installer from github) when joining to an RC2 grid." },
    { "summary": "Known Issue: Shipping Windows Eventlogs with Osquery will fail intermittently with utf8 errors logged in the Application log. This is scheduled to be fixed in Osquery 4.5." },
    { "summary": "Known Issue: When running soup to upgrade from RC1 to RC2, there is a Salt error that occurs during the final highstate. This error is related to the patch_os_schedule and can be ignored as it will not occur again in subsequent highstates." },
    { "summary": "Known Issue: When Search Nodes are upgraded from RC1 to RC2, there is a chance of a race condition where certificates are missing. This will show errors in the manager log to the remote node. To fix this run the following on the search node that is having the issue:<ul><li>Stop elasticsearch - <i>sudo so-elasticsearch-stop</i></li><li>Run the SSL state - <i>sudo salt-call state.apply ssl</i></li><li>Restart elasticsearch - <i>sudo so-elasticsearch-restart</i></li></ul>" },
    { "summary": "" },
    { "summary": "Fixed an issue where the console was timing out and making it appear that the installer was hung" },
    { "summary": "Introduced Import node type ideal for running so-import-pcap to import pcap files and view the resulting logs in Hunt or Kibana" },
    { "summary": "Moved static.sls to global.sls to align the name with the functionality" },
    { "summary": "Traffic between nodes in a distributed deployment is now fully encrypted" },
    { "summary": "Playbook<ul><li>Elastalert now runs active Plays every 3 minutes</li><li>Changed default rule-update config to only import Windows rules from the Sigma Community repo</li><li>Lots of bug fixes & stability improvements</li></ul>" },
    { "summary": "Ingest Node parsing updates for Osquery and Winlogbeat - implemented single pipeline for Windows eventlogs & sysmon logs" },
    { "summary": "Upgraded Osquery to 4.4 and re-enabled auto-updates" },
    { "summary": "Upgraded to Salt 3001.1" },
    { "summary": "Upgraded Wazuh to 3.13.1" },
    { "summary": "Hunt interface now shows the timezone being used for the selected date range" },
    { "summary": "Fixed Cortex initialization so that TheHive integration and initial user set is correctly configured" },
    { "summary": "Improved management of TheHive/Cortex credentials" },
    { "summary": "SOC now allows for arbitrary, time-bounded PCAP job creation, with optional filtering by host and port" },
    { "summary": "Historical release notes can be found on our docs site. <a href='https://docs.securityonion.net/en/2.1/release-notes.html'>https://docs.securityonion.net/en/2.1/release-notes.html</a>." },
  ]
}
