{
  "title": "Security Onion 2.2.0 RC3 is here!",
  "changes": [
    { "summary": "Known Issues <ul><li>Installing in VMware Fusion using Fusion's internal DNS server may result in Setup incorrectly claiming that the installation failed. To avoid this, configure the VM to bypass Fusion's internal DNS server and go directly to an upstream DNS server instead. <a href=https://github.com/Security-Onion-Solutions/securityonion/issues/1333>https://github.com/Security-Onion-Solutions/securityonion/issues/1333</a></li><li>Once you update your grid to RC3, any new nodes that join the grid must be RC3 so if you try to join a new RC1 node it will fail. For best results, use the latest RC3 ISO (or RC3 installer from github) when joining to an RC3 grid.</li><li>Shipping Windows Eventlogs with Osquery will fail intermittently with utf8 errors logged in the Application log. This is scheduled to be fixed in Osquery 4.5.</li><li>When running soup to upgrade from RC1/RC2 to RC3, there is a Salt error that occurs during the final highstate. This error is related to the patch_os_schedule and can be ignored as it will not occur again in subsequent highstates.</li><li>When Search Nodes are upgraded from RC1 to RC3, there is a chance of a race condition where certificates are missing. This will show errors in the manager log to the remote node. To fix this run the following on the search node that is having the issue:<ol><li>Stop elasticsearch - <i>sudo so-elasticsearch-stop</i></li><li>Run the SSL state - <i>sudo salt-call state.apply ssl</i></li><li>Restart elasticsearch - <i>sudo so-elasticsearch-restart</i></li></ol></li></ul>" },
    { "summary": "Setup now includes an option for airgap installations" },
    { "summary": "Playbook now works properly when installed in airgap mode" },
    { "summary": "Added so-analyst script to create an analyst workstation with GNOME desktop, Chromium browser, Wireshark, and NetworkMiner" },
    { "summary": "Upgraded Zeek to version 3.0.10 to address a recent security issue" },
    { "summary": "Upgraded Docker to latest version" },
    { "summary": "Re-worked IDSTools to make it easier to modify" },
    { "summary": "Added so-* tools to the default path so you can now tab complete" },
    { "summary": "so-status can now be run from a manager node to get the status of a remote node. Run salt <target> so.status" },
    { "summary": "Salt now prevents states from running on a node that it shouldn't so you can't, for example, accidentally apply the elasticsearch state on a forward node" },
    { "summary": "Added logic to check for Salt mine corruption and recover automatically" },
    { "summary": "Collapsed Hunt filter icons and action links into a new quick action bar that will appear when a field value is clicked; actions include:<ul><li>Filtering the hunt query</li><li>Pivot to PCAP</li><li>Create an alert in TheHive</li><li>Google search for the value</li><li>Analyze the value on VirusTotal.com</li></ul>" },
    { "summary": "Fixed minor bugs in Hunt user interface relating to most-recently used queries, tooltips, and more" },
    { "summary": "so-user-add now automatically adds users to Fleet and TheHive (in addition to SOC)" },
    { "summary": "Introduced so-user-disable and so-user-enable commands which allows administrators to lock out users that are no longer permitted to use Security Onion" },
    { "summary": "Added icon to SOC Users list representing their active or locked out status" },
    { "summary": "Removed User delete action from SOC interface in favor of disabling users for audit purposes" },
    { "summary": "Prune old PCAP job data from sensors once the results are streamed back to the manager node" },
    { "summary": "Hunt filtering to a specific value will search across all fields instead of only the field that was originally clicked" },
    { "summary": "Limiting PCAP jobs to extract at most 2GB from a sensor to avoid users accidentally requesting unreasonably large PCAP via the web interface" },
    { "summary": "so-test is back - run it to easily replay PCAPs and verify that all the components are working as expected (Requires Internet Access)" },
    { "summary": "New Elasticsearch subfield (".security") based on the new community-driven analyzer from @neu5ron - <a href="https://github.com/neu5ron/es_stk">https://github.com/neu5ron/es_stk</a>" },
    { "summary": "Playbook now uses the new .security subfield for case-insensitive wildcard searches" }     
  ]
}
