{
  "title": "Security Onion 2.3.10 is here!",
  "changes": [
		{ "summary": "UEFI installs with multiple disks should work as intended now." },
		{ "summary": "Telegraf scripts will now make sure they are not already running before execution." },
		{ "summary": "You are now prompted during setup if you want to change the docker IP range. If you change this it needs to be the same on all nodes in the grid." },
		{ "summary": "Soup will now download the new containers before stopping anything. If anything fails it will now exit and leave the grid at the current version." },
		{ "summary": "All containers are now hosted on quay.io to prevent pull limitations. We are now using GPG keys to determine if the image is from Security Onion." },
		{ "summary": "Osquery installers have been updated to osquery 4.5.1." },
		{ "summary": "Fix for bug where Playbook was not removing the Elastalert rules for inactive Plays." },
		{ "summary": "Exifdata reported by Strelka is now constrained to a single multi-valued field to prevent mapping explosion (scan.exiftool)." },
		{ "summary": "Resolved issue with Navigator layer(s) not loading correctly." },
		{ "summary": "Wazuh authd is now started by default on port 1515/tcp." },
		{ "summary": "Wazuh API default credentials are now removed after setup. Scripts have been added for API user management." },
		{ "summary": "Upgraded Salt to 3002.2 due to CVEs." },
		{ "summary": "If salt-minion is unable to apply states after the defined threshold, we assume salt-minion is in a bad state and the salt-minion service will be restarted." },
		{ "summary": "Fixed bug that prevented mysql from installing for Fleet if Playbook wasn't also installed." },
		{ "summary": "<code>so-status</code> will now show STARTING or WAIT_START, instead of ERROR, if <code>so-status</code> is run before a salt highstate has started or finished for the first time after system startup" },
		{ "summary": "Stenographer can now be disabled on a sensor node by setting the pillar steno:enabled:false in it's minion.sls file or globally if set in the global.sls file" },
		{ "summary": "Added <code>so-ssh-harden</code> script that runs the commands listed in <a href='https://docs.securityonion.net/en/2.3/ssh.html' target='so-help'>https://docs.securityonion.net/en/2.3/ssh.html</a>" },
		{ "summary": "NGINX now redirects the browser to the hostname/IP address/FQDN based on global:url_base" },
		{ "summary": "MySQL state now waits for MySQL server to respond to a query before completeing" },
		{ "summary": "Added Analyst option to network installs" },
		{ "summary": "Acknowledging (and Escalating) alerts did not consistently remove the alert from the visible list; this has been corrected." },
		{ "summary": "Escalating alerts that have a <i>rule.case_template</i> field defined will automatically assign that case template to the case generated in TheHive." },
		{ "summary": "Alerts and Hunt interface quick action bar has been converted into a vertical menu to improve quick action option clarity. Related changes also eliminated the issues that occurred when the quick action bar was appearing to the left of the visible browser area." },
		{ "summary": "Updated Go to newer version to fix a timezone, daylight savings time (DST) issue that resulted in Alerts and Hunt interfaces not consistently showing results." },
		{ "summary": "Improved Hunt and Alert table sorting." },
		{ "summary": "Alerts interface now allows absolute time searches." },
		{ "summary": "Alerts interface 'Hunt' quick action is now working as intended." },
		{ "summary": "Alerts interface 'Ack' icon tooltip has been changed from 'Dismiss' to 'Acknowledge' for consistency." },
		{ "summary": "Hunt interface bar charts will now show the quick action menu when clicked instead of assuming the click was intended to add an include filter." },
		{ "summary": "Hunt interface quick action will now cast a wider net on field searches." },
		{ "summary": "Now explicitly preventing the use of a dollar sign ($) character in web user passwords during setup." },
		{ "summary": "Cortex container will now restart properly if the SO host was not gracefully shutdown." },
		{ "summary": "Added syslog plugin to the logstash container; this is not in-use by default but available for those users that choose to use it." },
		{ "summary": "Winlogbeat download package is now available from the SOC Downloads interface." },
		{ "summary": "Upgraded Kratos authentication system." },
		{ "summary": "Added new Reset Defaults button to the SOC Profile Settings interface which allows users to reset all local browser SOC customizations back to their defaults. This includes things like default sort column, sort order, items per page, etc." },
    { "summary": "Known Issues <ul><li>Following the Salt minion upgrade on remote nodes, the salt-minion service may not restart properly. If this occurs, you can ssh to the minion and run <code>sudo systemctl restart salt-minion</code>. If you do not want to connect to each node and manually restart the salt-minion, the new salt-minion watch process will restart it automatically after 1 hour.</li><li>During soup, you may see the following during the first highstate run, it can be ignored: <code>Rendering SLS '<some_sls_name_here>' failed: Jinja variable 'list object' has no attribute 'values'</code>. The second highstate will complete without that error.</li></ul>" }
  ]
}
