{
  "title": "Security Onion 2.3.30 is here!",
  "changes": [
		{ "summary": "Zeek is now at version 3.0.13." },
		{ "summary": "CyberChef is now at version 9.27.2." },
		{ "summary": "Elastic components are now at version 7.10.2. This is the last version that uses the Apache license." },
		{ "summary": "Suricata is now at version 6.0.1." },
		{ "summary": "Suricata metadata parsing is now vastly improved." },
		{ "summary": "If you choose Suricata for metadata parsing, it will now extract files from the network and send them to Strelka. You can add additional mime types <a href='https://github.com/Security-Onion-Solutions/securityonion/blob/dev/salt/idstools/sorules/extraction.rules'>here</a>." },
		{ "summary": "It is now possible to filter Suricata events from being written to the logs. This is a new Suricata 6 feature. We have included some examples <a href='https://github.com/Security-Onion-Solutions/securityonion/blob/dev/salt/idstools/sorules/filters.rules'>here</a>." },
		{ "summary": "The Kratos docker container will now perform DNS lookups locally before reaching out to the network DNS provider." },
		{ "summary": "Network configuration is now more compatible with manually configured OpenVPN or Wireguard VPN interfaces." },
		{ "summary": "<code>so-sensor-clean</code> will no longer spawn multiple instances." },
		{ "summary": "Suricata eve.json logs will now be cleaned up after 7 days. This can be changed via the pillar setting." },
		{ "summary": "The automated backup script on the manager now backs up all keys along with the salt configurations. Backup retention is now set to 7 days." },
		{ "summary": "Strelka logs are now being rotated properly." },
		{ "summary": "Elastalert can now be customized via a pillar." },
		{ "summary": "Introduced new script <code>so-monitor-add</code> that allows the user to easily add interfaces to the bond for monitoring." },
		{ "summary": "Setup now validates all user input fields to give up-front feedback if an entered value is invalid." },
		{ "summary": "There have been several changes to improve install reliability. Many install steps have had their validation processes reworked to ensure that required tasks have been completed before moving on to the next step of the install." },
		{ "summary": "Users are now warned if they try to set <i>securityonion</i> as their hostname." },
		{ "summary": "The ISO should now identify xvda and nvme devices as install targets." },
		{ "summary": "At the end of the first stage of the ISO setup, the ISO device should properly unmount and eject." },
		{ "summary": "The text selection of choosing Suricata vs Zeek for metadata is now more descriptive." },
		{ "summary": "The logic for properly setting the <code>LOG_SIZE_LIMIT</code> variable has been improved." },
		{ "summary": "When installing on Ubuntu, Setup will now wait for cloud init to complete before trying to start the install of packages." },
		{ "summary": "The firewall state runs considerably faster now." },
		{ "summary": "ICMP timestamps are now disabled." },
		{ "summary": "Copyright dates on all Security Onion specific files have been updated." },
		{ "summary": "<code>so-tcpreplay</code> (and indirectly <code>so-test</code>) should now work properly." },
		{ "summary": "The Zeek packet loss script is now more accurate." },
		{ "summary": "Grafana now includes an estimated EPS graph for events ingested on the manager." },
		{ "summary": "Updated Elastalert to release 0.2.4-alt2 based on the <a href='https://github.com/jertel/elastalert'>jertel/elastalert</a> alt branch." },
		{ "summary": "Pivots from Alerts/Hunts to action links will properly URI encode values." },
		{ "summary": "Hunt timeline graph will properly scale the data point interval based on the search date range." },
		{ "summary": "Grid interface will properly show <i>Search</i> as the node type instead of <i>so-node</i>." },
		{ "summary": "Import node now supports airgap environments." },
		{ "summary": "The so-mysql container will now show <i>healthy</i> when viewing the docker ps output." },
		{ "summary": "The Soctopus configuration now uses private IPs instead of public IPs, allowing network communications to succeed within the grid." },
		{ "summary": "The Correlate action in Hunt now groups the OR filters together to ensure subsequent user-added filters are correctly ANDed to the entire OR group." },
		{ "summary": "Add support to <code>so-firewall</code> script to display existing port groups and host groups." },
		{ "summary": "TheHive initialization during Security Onion setup will now properly check for a running ES instance and will retry connectivity checks to TheHive before proceeding." },
		{ "summary": "Changes to the <i>.security</i> analyzer yields more accurate query results when using Playbook." },
		{ "summary": "Several Hunt queries have been updated." },
		{ "summary": "The pfSense firewall log parser has been updated to improve compatibility." },
		{ "summary": "Kibana dashboard hyperlinks have been updated for faster navigation." }
  ]
}
