{
  "title": "Security Onion 2.3.20 is here!",
  "changes": [
		{ "summary": "soup has been refactored. You will need to run it a few times to get all the changes properly. We are working on making this even easier for future releases."},
		{ "summary": "soup now has awareness of Elastic Features and now downloads the appropriate Docker containers."},
		{ "summary": "The Sensors interface has been renamed to Grid. This interface now includes all Security Onion nodes."},
		{ "summary": "Grid interface now includes the status of the node. The status currently shows either Online (blue) or Offline (orange). If a node does not check-in on time then it will be marked as Offline."},
		{ "summary": "Grid interface now includes the IP and Role of each node in the grid."},
		{ "summary": "Grid interface includes a new Filter search input to filter the visible list of grid nodes to a desired subset. As an example, typing in “sensor” will hide all nodes except those that behave as a sensor."},
		{ "summary": "The Grid description field can now be customized via the local minion pillar file for each node."},
		{ "summary": "SOC will now draw attention to an unhealthy situation within the grid or with the connection between the user’s browser and the manager node. For example, when the Grid has at least one Offline node the SOC interface will show an exclamation mark in front of the browser tab’s title and an exclamation mark next to the Grid menu option in SOC. Additionally, the favicon will show an orange marker in the top-right corner (dynamic favicons not supported in Safari). Additionally, if the user’s web browser is unable to communicate with the manager the unhealth indicators appear along with a message at the top of SOC that states there is a connection problem."},
		{ "summary": "Docker has been upgraded to the latest version."},
		{ "summary": "Docker should be more reliable now as Salt is now managing daemon.json."},
		{ "summary": "You can now install Elastic in a traditional cluster. When setting up the manager select Advanced and follow the prompts. Replicas are controlled in global.sls."},
		{ "summary": "You can now use Hot and Warm routing with Elastic in a traditional cluster. You can change the box.type in the minion’s sls file. You will need to create a curator job to re-tag the indexes based on your criteria."},
		{ "summary": "Telegraf has been updated to version 1.16.3."},
		{ "summary": "Grafana has been updated to 7.3.4 to resolve some XSS vulnerabilities."},
		{ "summary": "Grafana graphs have been changed to graphs vs guages so alerting can be set up."},
		{ "summary": "Grafana is now completely pillarized, allowing users to customize alerts and making it customizable for email, Slack, etc. See the docs <a href=\"https://securityonion.net/docs/grafana\">here</a>."},
		{ "summary": "Yara rules now should properly install on non-airgap installs. Previously, users had to wait for an automated job to place them in the correct location."},
		{ "summary": "Strelka backend will not stop itself any more. Previously, its behavior was to shut itself down after fifteen minutes and wait for Salt to restart it to look for work before shutting down again."},
		{ "summary": "Strelka daily rule updates are now logged to <code>/nsm/strelka/log/yara-update.log</code>"},
		{ "summary": "Several changes to the setup script to improve install reliability."},
		{ "summary": "Airgap now supports the import node type."},
		{ "summary": "Custom Zeek file extraction values in the pillar now work properly."},
		{ "summary": "TheHive has been updated to support Elastic 7."},
		{ "summary": "Cortex image now includes whois package to correct an issue with the CERTatPassiveDNS analyzer."},
		{ "summary": "Hunt and Alert quick action menu has been refactored into submenus."},
		{ "summary": "New clipboard quick actions now allow for copying fields or entire events to the clipboard."},
		{ "summary": "PCAP Add Job form now retains previous job details for quickly adding additional jobs. A new Clear button now exists at the bottom of this form to clear out these fields and forget the previous job details."},
		{ "summary": "PCAP Add Job form now allows users to perform arbitrary PCAP lookups of imported PCAP data (data imported via the <code>so-import-pcap</code> script)."},
		{ "summary": "Downloads page now allows direct download of Wazuh agents for Linux, Mac, and Windows from the manager, and shows the version of Wazuh and Elastic installed with Security Onion."},
		{ "summary": "PCAP job interface now shows additional job filter criteria when expanding the job filter details."},
		{ "summary": "Upgraded authentication backend to Kratos 0.5.5."},
		{ "summary": "SOC tables with the “Rows per Page” dropdown no longer show truncated page counts."},
		{ "summary": "Several Hunt errors are now more descriptive, particularly those around malformed queries."},
		{ "summary": "SOC Error banner has been improved to avoid showing raw HTML syntax, making connection and server-side errors more readable."},
		{ "summary": "Hunt and Alerts interfaces will now allow pivoting to PCAP from a group of results if the grouped results contain a network.community_id field."},
		{ "summary": "New “Correlate” quick action will pivot to a new Hunt search for all events that can be correlated by at least one of various event IDs."},
		{ "summary": "Fixed bug that caused some Hunt queries to not group correctly without a .keyword suffix. This has been corrected so that the .keyword suffix is no longer necessary on those groupby terms."},
		{ "summary": "Fixed issue where PCAP interface loses formatting and color coding when opening multiple PCAP tabs."},
		{ "summary": "Alerts interface now has a Refresh button that allows users to refresh the current alerts view without refreshing the entire SOC application."},
		{ "summary": "Hunt and Alerts interfaces now have an auto-refresh dropdown that will automatically refresh the current view at the selected frequency."},
		{ "summary": "The <code>so-elastalert-test</code> script has been refactored to work with Security Onion 2.3."},
		{ "summary": "The included Logstash image now includes Kafka plugins."},
		{ "summary": "Wazuh agent registration process has been improved to support slower hardware and networks."},
		{ "summary": "An Elasticsearch ingest pipeline has been added for suricata.ftp_data."},
		{ "summary": "Elasticsearch’s indices.query.bool.max_clause_count value has been increased to accommodate a slightly larger number of fields (1024 -> 1500) when querying using a wildcard."},
		{ "summary": "On nodes being added to an existing grid, setup will compare the version currently being installed to the manager (>=2.3.20), pull the correct Security Onion version from the manager if there is a mismatch, and run that version."},
		{ "summary": "Setup will gather any errors found during a failed install into <code>/root/errors.log</code> for easy copy/paste and debugging."},
		{ "summary": "Selecting Suricata as the metadata engine no longer results in the install failing."},
		{ "summary": "<code>so-rule-update</code> now accepts arguments to idstools. For example, <code>so-rule-update -f</code> will force idstools to pull rules, ignoring the default 15-minute pull limit."}
  ]
}
