{
  "title": "Introducing Hybrid Hunter 1.3.0 Beta 2",
  "changes": [
    { "summary": "New Feature: Codename: \"Onion Hunt\". Select Hunt from the menu and start hunting down your adversaries!" },
    { "summary": "Improved ECS support." },
    { "summary": "Complete refactor of the setup to make it easier to follow." },
    { "summary": "Improved setup script logging to better assist on any issues." },
    { "summary": "Setup now checks for minimal requirements during install." },
    { "summary": "Updated Cyberchef to version 9.20.3." },
    { "summary": "Updated Elastalert to version 0.2.4 and switched to alpine to reduce container size." },
    { "summary": "Updated Redis to 5.0.9 and switched to alpine to reduce container size." },
    { "summary": "Updated Salt to 2019.2.5." },
    { "summary": "Updated Grafana to 6.7.3." },
    { "summary": "Zeek 3.0.6." },
    { "summary": "Suricata 4.1.8." },
    { "summary": "Fixes so-status to now display correct containers and status." },
    { "summary": "local.zeek is now controlled by a pillar instead of modifying the file directly." },
    { "summary": "Renamed so-core to so-nginx and switched to alpine to reduce container size." },
    { "summary": "Playbook now uses MySQL instead of SQLite." },
    { "summary": "Sigma rules have all been updated." },
    { "summary": "Kibana dashboard improvements for ECS." },
    { "summary": "Fixed an issue where geoip was not properly parsed." },
    { "summary": "ATT&CK Navigator is now it's own state." },
    { "summary": "Standlone mode is now supported." },
    { "summary": "Mastersearch previously used the same Grafana dashboard as a Search node. It now has its own dashboard that incorporates panels from the Master node and Search node dashboards." },
    { "summary": "KNOWN ISSUE: The Hunt feature is currently considered \"Preview\" and although very useful in its current state, not everything works. We wanted to get this out as soon as possible to get the feedback from you! Let us know what you want to see! Let us know what you think we should call it!" },
    { "summary": "KNOWN ISSUE: You cannot pivot to PCAP from Suricata alerts in Kibana or Hunt." },
    { "summary": "KNOWN ISSUE: Navigator is currently not working when using hostname to access SOC. IP mode works correctly." },
    { "summary": "KNOWN ISSUE: Updating users via the SOC ui is known to fail. To change a user, delete the user and re-add them." },
    { "summary": "KNOWN ISSUE: Due to the move to ECS, the current Playbook plays may not alert correctly at this time." },
    { "summary": "KNOWN ISSUE: The osquery MacOS package does not install correctly." }
  ]
}
