title: SO IDH - FTP Login Attempt
id: d2d82069-30a7-4ac3-b584-ba696fbc24fd
status: experimental
description: Detects when the FTP service on a SO IDH node has had a login attempt.
author: Security Onion Solutions
license: MIT
references: 
  - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
  - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  product: opencanary
detection:
  selection:
    logtype:
    - 2000
  custom_filter:
    source.ip:
    - x.x.x.x
  condition: selection #and not custom_filter
falsepositives:
  - None
fields:
  - source.ip
level: critical