title: SO IDH - VNC Login Attempt
id: 2d4ec11b-9d7c-464f-a9fa-e555e5cd605a
status: experimental
description: Detects when the VNC service on a SO IDH node has had a login attempt.
author: Security Onion Solutions
license: MIT
references: 
  - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
  - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  product: opencanary
detection:
  selection:
    logtype:
    - 12001 
  condition: selection
falsepositives:
  - None
fields:
  - source.ip
level: critical