title: SO IDH - MSSQL Attempted Login
id: 3c36173e-9b56-4b03-b2d4-d420a9a7917f
status: experimental
description: Detects when the MS SQL service on a SO IDH node has had a login attempt.
author: Security Onion Solutions
license: MIT
references: 
  - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
  - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  product: opencanary
detection:
  selection:
    logtype:
    - 9001 #SQL Auth
    - 9002 #Windows Auth
  condition: selection
falsepositives:
  - None
fields:
  - source.ip
level: critical