title: SO IDH - TFTP Requests
id: 6722bba8-5713-4463-b3ab-8432224928c2
status: experimental
description: Detects when the TFTP service on a SO IDH node has had requests.
author: Security Onion Solutions
logsource:
  product: idh
detection:
  selection:
    event.code:
    - 2000
  condition: selection
falsepositives:
  - None
fields:
  - source.ip
level: critical