title: SO IDH - HTTP Proxy Attempted Proxy Login
id: 6722bba8-5713-4463-b3ab-8432224928c2
status: experimental
description: Detects when the HTTP Proxy service on a SO IDH node has had a proxy login attempt.
author: Security Onion Solutions
license: MIT
references: 
  - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
  - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  product: opencanary
detection:
  selection:
    logtype:
    - 7001
  custom_filter:
    source.ip:
    - x.x.x.x
  condition: selection #and not custom_filter
falsepositives:
  - None
fields:
  - source.ip
level: critical