title: SO IDH - Redis Accessed
id: 61bd7f23-90c4-41b0-a70d-9991b863e3f7
status: experimental
description: Detects when the Redis service on a SO IDH node has had an action sent to it.
author: Security Onion Solutions
license: MIT
references: 
  - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
  - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  product: opencanary
detection:
  selection:
    logtype:
    - 17001
  condition: selection
falsepositives:
  - None
fields:
  - source.ip
level: critical