title: SO IDH - MySQL Attempted Login
id: fd9bfee4-301c-40e2-8f4e-857088cb3969
status: experimental
description: Detects when the MySQL service on a SO IDH node has had a login attempt.
author: Security Onion Solutions
license: MIT
references: 
  - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
  - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  product: opencanary
detection:
  selection:
    logtype:
    - 8001
  condition: selection
falsepositives:
  - None
fields:
  - source.ip
level: critical