title: SO IDH - HTTP Login Attempt
id: 19449e62-93fa-40bd-8d0a-2564535d3652
status: experimental
description: Detects when the HTTP service on a SO IDH node has had a login attempt.
author: Security Onion Solutions
license: MIT
references: 
  - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
  - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  product: opencanary
detection:
  selection:
    logtype:
    - 3001
  custom_filter:
    source.ip:
    - x.x.x.x
  condition: selection #and not custom_filter
falsepositives:
  - None
fields:
  - source.ip
level: critical