title: SO IDH - HTTP Accessed
id: 34300b04-3350-4f4b-bf8c-9bfbfdc9914f
status: experimental
description: Detects when the HTTP service on a SO IDH node has had a Get request.
author: Security Onion Solutions
license: MIT
references: 
  - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
  - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  product: opencanary
detection:
  selection:
    logtype:
    - 3000
  custom_filter:
    source.ip:
    - x.x.x.x
  condition: selection #and not custom_filter
falsepositives:
  - None
fields:
  - source.ip
level: critical